"""
Вася тестирует новую функцию своей соцсети Person, а именно, ограничение количества друзей, которых могут видеть другие
 пользователи. Для этого он использует новую функцию delattr(). Помогите Васе скрыть определённых друзей, чтобы их
 не видели другие пользователи.
Задание
Часть кода уже написана. Переменная names содержит список имён.
Проверить, есть ли в списке names имена атрибутов класса Person.
Если имя в списке и имя атрибута в классе совпадают, удалите атрибут из класса.
Ваша задача только проверить и удалить совпадающие атрибуты, всё остальное уже готово.
# напоминашка
delattr(object, name)
# object - объект, у которого нужно удалить атрибут.
# name - имя атрибута, который нужно удалить.
"""



