from random import sample

magic_ing = ["Черные коты", "Лягушачьи глаза", "Паутина", "Корень мандрагоры",
             "Жабий язык", "Женский волос", "Крысы", "Любовное зелье", "Кровь дракона",
             "Пепел отрока", "Чертополох", "Пыльца беладонны", "Черная свеча",
             "Сердце ворона", "Собачий клык", "Масло лунного света", "Костыли ведьмы",
             "Подземный гриб", "Крыло летучей мыши", "Ядовитый плющ", "Перо ворона",
             "Камень чародея", "Слезы совы", "Горсть звездной пыли", "Волшебный кристалл",
             "Костер из драконьих костей", "Зелье бессмертия", "Черная роза",
             "Древний свиток заклинаний", "Ключ от врат ада"]


class Magic:
    ingredients = sample(magic_ing, 3)


print("Офигительный коктейль = ", end="")

my_cocktail = Magic()
print(*getattr(my_cocktail, "ingredients"), sep=" + ")
